<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"98fa616d49897daae5a1bfddf22e5ede98b1a47ceae55ff08e90545c9a372597","plan_job_ref":"Job Staging Image Build & Push #37 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7330499360","plan_hash":"b415ec71925c5a545de2a87f68fd87934667777f3a1cbd790f827942fe912840","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster will be created
+   resource "aws_ecs_cluster" "fastapi-cluster" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "dev-fastapi-cluster"
+       tags_all = (known after apply)

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "dev-fastapi-container"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-0ac5d9e923d0871aa",
            ]
+           subnets          = (sensitive value)
        }
    }

  # aws_ecs_task_definition.task_definition_1 will be created
+   resource "aws_ecs_task_definition" "task_definition_1" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu          = 1024
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
+                   memory       = 2048
+                   name         = "dev_FastAPI_definition"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       cpu                      = "1024"
+       family                   = "dev-fastapi-container"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #37](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7330499360)